qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2016 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        16. February 2016
 * $Revision:    V1.0
 *
 * Driver:       Driver_I2C0, Driver_I2C1, Driver_I2C2, Driver_I2C3
 *               Driver_I2C4, Driver_I2C5, Driver_I2C6, Driver_I2C7
 * Configured:   via RTE_Device.h configuration file
 * Project:      I2C Driver for NXP LPC5411x
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   I2C Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_I2C# = 0       use I2C0
 *   Connect to hardware via Driver_I2C# = 1       use I2C1
 *   Connect to hardware via Driver_I2C# = 2       use I2C2
 *   Connect to hardware via Driver_I2C# = 3       use I2C3
 *   Connect to hardware via Driver_I2C# = 4       use I2C4
 *   Connect to hardware via Driver_I2C# = 5       use I2C5
 *   Connect to hardware via Driver_I2C# = 6       use I2C6
 *   Connect to hardware via Driver_I2C# = 7       use I2C7
 * -------------------------------------------------------------------------- */

/* Note:
    When using DMA data transfer mode, make sure that application calls function
    Chip_DMASERVICE_Isr (part of LPCOpen firmware package, see dma_service_5411x.h
    for details) to handle DMA IRQ requests. Two possible ways are as follows:

    a) Replace all occurences of DMA_IRQHandler in device startup code
       with Chip_DMASERVICE_Isr
    b) Implement DMA_IRQHandler function which calls Chip_DMASERVICE_Isr:
       void DMA_IRQHandler (void) {
         Chip_DMASERVICE_Isr();
       }
 */

/* History:
 *  Version 1.0
 *    - Initial release
 */

#include "I2C_LPC5411x.h"

#define ARM_I2C_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0) /* driver version */

/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
  ARM_I2C_API_VERSION,
  ARM_I2C_DRV_VERSION
};

/* Driver Capabilities */
static const ARM_I2C_CAPABILITIES DriverCapabilities = {
  1            /* supports 10-bit addressing */
};


#ifdef RTE_I2C0
/* I2C0 Control Information */
static I2C_INFO I2C0_Ctrl = { 0 };

/* I2C0 DMA Resources */
#if defined(I2C0_DMA_MASTER_EN) || defined(I2C0_DMA_SLAVE_EN)
static void I2C0_DMA_Callback (int32_t);
#endif

#if defined(I2C0_DMA_MASTER_EN)
static const I2C_DMA I2C0_DMA_Master = { DMAREQ_I2C0_MASTER, &I2C0_DMA_Callback };
#endif
#if defined(I2C0_DMA_SLAVE_EN)
static const I2C_DMA I2C0_DMA_Slave = { DMAREQ_I2C0_SLAVE, &I2C0_DMA_Callback };
#endif

/* I2C0 Resources */
static I2C_RESOURCES I2C0_Resources = {
  LPC_I2C0,
  I2C0_IRQn,
  I2C0_SYSCON_CLOCK,
  { I2C0_SCL_PORT, I2C0_SCL_PIN, I2C0_SCL_FUNC },
  { I2C0_SDA_PORT, I2C0_SDA_PIN, I2C0_SDA_FUNC },
  #if defined(I2C0_DMA_MASTER_EN)
  &I2C0_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C0_DMA_SLAVE_EN)
  &I2C0_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C0_Ctrl
};
#endif /* RTE_I2C0 */


#ifdef RTE_I2C1
/* I2C1 Control Information */
static I2C_INFO I2C1_Ctrl = { 0 };

/* I2C1 DMA Resources */
#if defined(I2C1_DMA_MASTER_EN) || defined(I2C1_DMA_SLAVE_EN)
static void I2C1_DMA_Callback (int32_t);
#endif

#if defined(I2C1_DMA_MASTER_EN)
static const I2C_DMA I2C1_DMA_Master = { DMAREQ_I2C1_MASTER, &I2C1_DMA_Callback };
#endif
#if defined(I2C1_DMA_SLAVE_EN)
static const I2C_DMA I2C1_DMA_Slave = { DMAREQ_I2C1_SLAVE, &I2C1_DMA_Callback };
#endif

/* I2C1 Resources */
static I2C_RESOURCES I2C1_Resources = {
  LPC_I2C1,
  I2C1_IRQn,
  I2C0_SYSCON_CLOCK,
  { I2C1_SCL_PORT, I2C1_SCL_PIN, I2C1_SCL_FUNC },
  { I2C1_SDA_PORT, I2C1_SDA_PIN, I2C1_SDA_FUNC },
  #if defined(I2C1_DMA_MASTER_EN)
  &I2C1_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C1_DMA_SLAVE_EN)
  &I2C1_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C1_Ctrl
};
#endif /* RTE_I2C1 */


#ifdef RTE_I2C2
/* I2C2 Control Information */
static I2C_INFO I2C2_Ctrl = { 0 };

/* I2C2 DMA Resources */
#if defined(I2C2_DMA_MASTER_EN) || defined(I2C2_DMA_SLAVE_EN)
static void I2C2_DMA_Callback (int32_t);
#endif

#if defined(I2C2_DMA_MASTER_EN)
static const I2C_DMA I2C2_DMA_Master = { DMAREQ_I2C2_MASTER, &I2C2_DMA_Callback };
#endif
#if defined(I2C2_DMA_SLAVE_EN)
static const I2C_DMA I2C2_DMA_Slave = { DMAREQ_I2C2_SLAVE, &I2C2_DMA_Callback };
#endif

/* I2C2 Resources */
static I2C_RESOURCES I2C2_Resources = {
  LPC_I2C2,
  I2C2_IRQn,
  I2C2_SYSCON_CLOCK,
  { I2C2_SCL_PORT, I2C2_SCL_PIN, I2C2_SCL_FUNC },
  { I2C2_SDA_PORT, I2C2_SDA_PIN, I2C2_SDA_FUNC },
  #if defined(I2C2_DMA_MASTER_EN)
  &I2C2_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C2_DMA_SLAVE_EN)
  &I2C2_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C2_Ctrl
};
#endif /* RTE_I2C2 */

#ifdef RTE_I2C3
/* I2C3 Control Information */
static I2C_INFO I2C3_Ctrl = { 0 };

/* I2C3 DMA Resources */
#if defined(I2C3_DMA_MASTER_EN) || defined(I2C3_DMA_SLAVE_EN)
static void I2C3_DMA_Callback (int32_t);
#endif

#if defined(I2C3_DMA_MASTER_EN)
static const I2C_DMA I2C3_DMA_Master = { DMAREQ_I2C3_MASTER, &I2C3_DMA_Callback };
#endif
#if defined(I2C3_DMA_SLAVE_EN)
static const I2C_DMA I2C3_DMA_Slave = { DMAREQ_I2C3_SLAVE, &I2C3_DMA_Callback };
#endif

/* I2C3 Resources */
static I2C_RESOURCES I2C3_Resources = {
  LPC_I2C3,
  I2C3_IRQn,
  I2C3_SYSCON_CLOCK,
  { I2C3_SCL_PORT, I2C3_SCL_PIN, I2C3_SCL_FUNC },
  { I2C3_SDA_PORT, I2C3_SDA_PIN, I2C3_SDA_FUNC },
  #if defined(I2C3_DMA_MASTER_EN)
  &I2C3_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C3_DMA_SLAVE_EN)
  &I2C3_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C3_Ctrl
};
#endif /* RTE_I2C3 */

#ifdef RTE_I2C4
/* I2C4 Control Information */
static I2C_INFO I2C4_Ctrl = { 0 };

