qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
/* I2C4 DMA Resources */
#if defined(I2C4_DMA_MASTER_EN) || defined(I2C4_DMA_SLAVE_EN)
static void I2C4_DMA_Callback (int32_t);
#endif

#if defined(I2C4_DMA_MASTER_EN)
static const I2C_DMA I2C4_DMA_Master = { DMAREQ_I2C4_MASTER, &I2C4_DMA_Callback };
#endif
#if defined(I2C4_DMA_SLAVE_EN)
static const I2C_DMA I2C4_DMA_Slave = { DMAREQ_I2C4_SLAVE, &I2C4_DMA_Callback };
#endif

/* I2C4 Resources */
static I2C_RESOURCES I2C4_Resources = {
  LPC_I2C4,
  I2C4_IRQn,
  I2C4_SYSCON_CLOCK,
  { I2C4_SCL_PORT, I2C4_SCL_PIN, I2C4_SCL_FUNC },
  { I2C4_SDA_PORT, I2C4_SDA_PIN, I2C4_SDA_FUNC },
  #if defined(I2C4_DMA_MASTER_EN)
  &I2C4_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C4_DMA_SLAVE_EN)
  &I2C4_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C4_Ctrl
};
#endif /* RTE_I2C4 */

#ifdef RTE_I2C5
/* I2C5 Control Information */
static I2C_INFO I2C5_Ctrl = { 0 };

/* I2C5 DMA Resources */
#if defined(I2C5_DMA_MASTER_EN) || defined(I2C5_DMA_SLAVE_EN)
static void I2C5_DMA_Callback (int32_t);
#endif

#if defined(I2C5_DMA_MASTER_EN)
static const I2C_DMA I2C5_DMA_Master = { DMAREQ_I2C5_MASTER, &I2C5_DMA_Callback };
#endif
#if defined(I2C5_DMA_SLAVE_EN)
static const I2C_DMA I2C5_DMA_Slave = { DMAREQ_I2C5_SLAVE, &I2C5_DMA_Callback };
#endif

/* I2C5 Resources */
static I2C_RESOURCES I2C5_Resources = {
  LPC_I2C5,
  I2C5_IRQn,
  I2C5_SYSCON_CLOCK,
  { I2C5_SCL_PORT, I2C5_SCL_PIN, I2C5_SCL_FUNC },
  { I2C5_SDA_PORT, I2C5_SDA_PIN, I2C5_SDA_FUNC },
  #if defined(I2C5_DMA_MASTER_EN)
  &I2C5_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C5_DMA_SLAVE_EN)
  &I2C5_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C5_Ctrl
};
#endif /* RTE_I2C5 */

#ifdef RTE_I2C6
/* I2C6 Control Information */
static I2C_INFO I2C6_Ctrl = { 0 };

/* I2C6 DMA Resources */
#if defined(I2C6_DMA_MASTER_EN) || defined(I2C6_DMA_SLAVE_EN)
static void I2C6_DMA_Callback (int32_t);
#endif

#if defined(I2C6_DMA_MASTER_EN)
static const I2C_DMA I2C6_DMA_Master = { DMAREQ_I2C6_MASTER, &I2C6_DMA_Callback };
#endif
#if defined(I2C6_DMA_SLAVE_EN)
static const I2C_DMA I2C6_DMA_Slave = { DMAREQ_I2C6_SLAVE, &I2C6_DMA_Callback };
#endif

/* I2C6 Resources */
static I2C_RESOURCES I2C6_Resources = {
  LPC_I2C6,
  I2C6_IRQn,
  I2C6_SYSCON_CLOCK,
  { I2C6_SCL_PORT, I2C6_SCL_PIN, I2C6_SCL_FUNC },
  { I2C6_SDA_PORT, I2C6_SDA_PIN, I2C6_SDA_FUNC },
  #if defined(I2C6_DMA_MASTER_EN)
  &I2C6_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C6_DMA_SLAVE_EN)
  &I2C6_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C6_Ctrl
};
#endif /* RTE_I2C6 */

#ifdef RTE_I2C7
/* I2C7 Control Information */
static I2C_INFO I2C7_Ctrl = { 0 };

/* I2C7 DMA Resources */
#if defined(I2C7_DMA_MASTER_EN) || defined(I2C7_DMA_SLAVE_EN)
static void I2C7_DMA_Callback (int32_t);
#endif

#if defined(I2C7_DMA_MASTER_EN)
static const I2C_DMA I2C7_DMA_Master = { DMAREQ_I2C7_MASTER, &I2C7_DMA_Callback };
#endif
#if defined(I2C7_DMA_SLAVE_EN)
static const I2C_DMA I2C7_DMA_Slave = { DMAREQ_I2C7_SLAVE, &I2C7_DMA_Callback };
#endif

/* I2C7 Resources */
static I2C_RESOURCES I2C7_Resources = {
  LPC_I2C7,
  I2C7_IRQn,
  I2C7_SYSCON_CLOCK,
  { I2C7_SCL_PORT, I2C7_SCL_PIN, I2C7_SCL_FUNC },
  { I2C7_SDA_PORT, I2C7_SDA_PIN, I2C7_SDA_FUNC },
  #if defined(I2C7_DMA_MASTER_EN)
  &I2C7_DMA_Master,
  #else
  NULL,
  #endif
  #if defined(I2C7_DMA_SLAVE_EN)
  &I2C7_DMA_Slave,
  #else
  NULL,
  #endif
  &I2C7_Ctrl
};
#endif /* RTE_I2C7 */

/* DMA Callback function prototypes */
void I2C0_DMACallback (int32_t intb);


/**
  \fn          ARM_DRIVER_VERSION I2C_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION I2C_GetVersion (void) {
  return DriverVersion;
}

/**
  \fn          ARM_I2C_CAPABILITIES I2C_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_I2C_CAPABILITIES
*/
static ARM_I2C_CAPABILITIES I2C_GetCapabilities (void) {
  return DriverCapabilities;
}

/**
  \fn          int32_t I2Cx_Initialize (ARM_I2C_SignalEvent_t cb_event,
                                        I2C_RESOURCES         *i2c)
  \brief       Initialize I2C Interface.
  \param[in]   cb_event  Pointer to \ref ARM_I2C_SignalEvent
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_Initialize (ARM_I2C_SignalEvent_t cb_event, I2C_RESOURCES *i2c) {
#if defined(I2C_DMA_MASTER_EN) || defined(I2C_DMA_SLAVE_EN)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if (i2c->info->flags & I2C_INIT) { return ARM_DRIVER_OK; }

  /* Enable power */
  Chip_Clock_EnablePeriphClock (SYSCON_CLOCK_IOCON);
  Chip_Clock_EnablePeriphClock (SYSCON_CLOCK_GPIO0);
  Chip_Clock_EnablePeriphClock (SYSCON_CLOCK_GPIO1);

  /* Configure I2C pins */
  Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, I2C_PIN_IOCON_STANDARD);
  Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, I2C_PIN_IOCON_STANDARD);

#if defined(I2C_DMA_MASTER_EN) || defined(I2C_DMA_SLAVE_EN)
  if (i2c->dma_master || i2c->dma_slave) {
    if ((LPC_SYSCON->AHBCLKCTRL[0] & SYSCON_CLOCK_DMA) == 0) {
      /* DMA clock is disabled, init DMA service */
      Chip_DMASERVICE_Init (Chip_DMA_Table);
    }

    /* Enable DMA IRQ in NVIC */
    NVIC_EnableIRQ(DMA_IRQn);

    #if defined(I2C_DMA_MASTER_EN)
    if (i2c->dma_master != NULL) {
      /* Configure master channel */
      Chip_DMA_EnableChannel     (LPC_DMA, i2c->dma_master->ch);
      Chip_DMA_EnableIntChannel  (LPC_DMA, i2c->dma_master->ch);
      Chip_DMA_SetupChannelConfig(LPC_DMA, i2c->dma_master->ch, DMA_CFG_PERIPHREQEN);

      dma_context.channel = i2c->dma_master->ch;
      Chip_DMASERVICE_RegisterCb (&dma_context, i2c->dma_master->callback);
    }
    #endif
    
    #if defined(I2C_DMA_SLAVE_EN)
    if (i2c->dma_slave != NULL) {
      /* Configure slave channel */
      Chip_DMA_EnableChannel     (LPC_DMA, i2c->dma_slave->ch);
      Chip_DMA_EnableIntChannel  (LPC_DMA, i2c->dma_slave->ch);
      Chip_DMA_SetupChannelConfig(LPC_DMA, i2c->dma_slave->ch, DMA_CFG_PERIPHREQEN);

      dma_context.channel = i2c->dma_slave->ch;
      Chip_DMASERVICE_RegisterCb (&dma_context, i2c->dma_slave->callback);
    }
    #endif
  }
#endif

  /* Reset Run-Time information structure */
  memset (i2c->info, 0x00, sizeof (I2C_INFO));

  i2c->info->cb_event = cb_event;
  i2c->info->flags    = I2C_INIT;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_Uninitialize (I2C_RESOURCES *i2c)
  \brief       De-initialize I2C Interface.
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_Uninitialize (I2C_RESOURCES *i2c) {

