qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
  i2c->info->flags = 0U;

  /* Unconfigure SCL and SDA pins */
  Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, I2C_PIN_IOCON_GPIO);
  Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, I2C_PIN_IOCON_GPIO);

  /* Disable DMA channels */
#if defined(I2C_DMA_MASTER_EN)
  if (i2c->dma_master) {
    Chip_DMA_DisableChannel (LPC_DMA, i2c->dma_master->ch);
  }
#endif
#if defined(I2C_DMA_SLAVE_EN)
  if (i2c->dma_slave) {
    Chip_DMA_DisableChannel (LPC_DMA, i2c->dma_slave->ch);
  }
#endif

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_PowerControl (ARM_POWER_STATE state,
                                          I2C_RESOURCES   *i2c)
  \brief       Control I2C Interface Power.
  \param[in]   state  Power state
  \param[in]   i2c    Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_PowerControl (ARM_POWER_STATE state, I2C_RESOURCES *i2c) {

  switch (state) {
    case ARM_POWER_OFF:
      /* Power off I2C peripheral */
      NVIC_DisableIRQ (i2c->irqn);

      /* Enable power */
      Chip_Clock_EnablePeriphClock (i2c->clk_msk);

      if (i2c->info->status.busy) {
        if (i2c->info->status.mode) {
          Chip_I2CM_SendStop (i2c->reg);
        }
        else {
          if (i2c->info->status.direction != 0) {
            /* Slave receiver */
            Chip_I2CS_SlaveNACK (i2c->reg);
          }
        }
      }

      i2c->info->status.busy             = 0U;
      i2c->info->status.mode             = 0U;
      i2c->info->status.direction        = 0U;
      i2c->info->status.general_call     = 0U;
      i2c->info->status.arbitration_lost = 0U;
      i2c->info->status.bus_error        = 0U;

      i2c->info->flags  &= ~I2C_POWER;

      /* Disable master/slave interface */
      Chip_I2CM_Disable (i2c->reg);
      Chip_I2CS_Disable (i2c->reg);

      /* Deinit peripheral */
      Chip_I2C_DeInit (i2c->reg);
      break;

    case ARM_POWER_FULL:
      if ((i2c->info->flags & I2C_INIT)  == 0U) { return ARM_DRIVER_ERROR; }
      if ((i2c->info->flags & I2C_POWER) != 0U) { return ARM_DRIVER_OK; }

      /* Init peripheral (enable clock + reset) */
      Chip_I2C_Init (i2c->reg);

      /* Enable master interface */
      Chip_I2CM_Enable (i2c->reg);

      /* Enable master interrupts */
      Chip_I2C_EnableInt (i2c->reg, I2C_INTENSET_MSTRARBLOSS |
                                    I2C_INTENSET_MSTSTSTPERR);

      /* Enable I2C interrupts in NVIC */
      NVIC_ClearPendingIRQ (i2c->irqn);
      NVIC_EnableIRQ       (i2c->irqn);

      i2c->info->flags |= I2C_POWER;
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_MasterTransmit (uint32_t       addr,
                                            const uint8_t *data,
                                            uint32_t       num,
                                            bool           xfer_pending,
                                            I2C_RESOURCES *i2c)
  \brief       Start transmitting data as I2C Master.
  \param[in]   addr          Slave address (7-bit or 10-bit)
  \param[in]   data          Pointer to buffer with data to transmit to I2C Slave
  \param[in]   num           Number of data bytes to transmit
  \param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
  \param[in]   i2c           Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_MasterTransmit (uint32_t       addr,
                                    const uint8_t *data,
                                    uint32_t       num,
                                    bool           xfer_pending,
                                    I2C_RESOURCES *i2c) {
#if defined(I2C_DMA_MASTER_EN)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data == NULL) || (num == 0U)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((addr & ~(ARM_I2C_ADDRESS_10BIT | ARM_I2C_ADDRESS_GC)) > 0x3FFU) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->info->status.busy) {
    return ARM_DRIVER_ERROR_BUSY;
  }

  if ((Chip_I2CM_GetStatus (i2c->reg) & I2C_STAT_MSTPENDING) == 0U) {
    /* Communication in progress */
    return ARM_DRIVER_ERROR_BUSY;
  }

  /* Update driver status and setup transfer */
  i2c->info->status.busy             = 1U;
  i2c->info->status.mode             = 1U;
  i2c->info->status.direction        = 0U;
  i2c->info->status.arbitration_lost = 0U;
  i2c->info->status.bus_error        = 0U;

  i2c->info->xfer.data = (uint8_t *)data;
  i2c->info->xfer.num  = num;
  i2c->info->xfer.cnt  = 0U;
  i2c->info->xfer.addr = (uint16_t)addr;
  i2c->info->xfer.ctrl = 0U;

  if (xfer_pending) {
    i2c->info->xfer.ctrl |= XFER_CTRL_XPENDING;
  }
  if ((addr & ARM_I2C_ADDRESS_10BIT) == 0U) {
    i2c->info->xfer.ctrl |= XFER_CTRL_ADDR_DONE;
  }

  /* Write address and direction bit into data buffer */
  addr  &= 0x7F;
  addr <<= 1;
  Chip_I2CM_WriteByte (i2c->reg, addr);

#if defined(I2C_DMA_MASTER_EN)
  if (i2c->dma_master) {
    if (num > 1024U) { num = 1024U; }

    i2c->info->xfer.pend = num;

    /* Configure master channel */
    dma_context.channel           = i2c->dma_master->ch;
    dma_context.register_location = (volatile uint32_t *)&(i2c->reg->MSTDAT);
    dma_context.width             = DMA_XFERCFG_WIDTH_8;
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_1;
    dma_context.write             = true;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)i2c->info->xfer.data, num);

    /* Enable DMA transfer and generate start */
    i2c->reg->MSTCTL = I2C_MSTCTL_MSTSTART | I2C_MSTCTL_MSTDMA;
  } else
#endif
  {
    /* Generate start */
    Chip_I2CM_SendStart (i2c->reg);
  }

  /* Enable pending interrupt */
  Chip_I2C_EnableInt (i2c->reg, I2C_INTENSET_MSTPENDING);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_MasterReceive (uint32_t       addr,
                                           uint8_t       *data,
                                           uint32_t       num,
                                           bool           xfer_pending,
                                           I2C_RESOURCES *i2c)
  \brief       Start receiving data as I2C Master.
  \param[in]   addr          Slave address (7-bit or 10-bit)
  \param[out]  data          Pointer to buffer for data to receive from I2C Slave
  \param[in]   num           Number of data bytes to receive
  \param[in]   xfer_pending  Transfer operation is pending - Stop condition will not be generated
  \param[in]   i2c           Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_MasterReceive (uint32_t       addr,
                                   uint8_t       *data,
                                   uint32_t       num,
                                   bool           xfer_pending,
                                   I2C_RESOURCES *i2c) {
#if defined(I2C_DMA_MASTER_EN)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

