qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
  if ((data == NULL) || (num == 0U)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((addr & ~(ARM_I2C_ADDRESS_10BIT | ARM_I2C_ADDRESS_GC)) > 0x3FFU) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->info->status.busy) {
    return ARM_DRIVER_ERROR_BUSY;
  }

  if ((Chip_I2CM_GetStatus (i2c->reg) & I2C_STAT_MSTPENDING) == 0U) {
    /* Communication in progress */
    return ARM_DRIVER_ERROR_BUSY;
  }

  /* Update driver status and setup transfer */
  i2c->info->status.busy             = 1U;
  i2c->info->status.mode             = 1U;
  i2c->info->status.direction        = 1U;
  i2c->info->status.arbitration_lost = 0U;
  i2c->info->status.bus_error        = 0U;

  i2c->info->xfer.data = data;
  i2c->info->xfer.num  = num;
  i2c->info->xfer.cnt  = 0U;
  i2c->info->xfer.addr = (uint16_t)addr;
  i2c->info->xfer.ctrl = 0U;

  if (xfer_pending) {
    i2c->info->xfer.ctrl |= XFER_CTRL_XPENDING;
  }
  if ((addr & ARM_I2C_ADDRESS_10BIT) == 0U) {
    i2c->info->xfer.ctrl |= XFER_CTRL_ADDR_DONE;
  }

  /* Write address and direction bit into data buffer */
  addr  &= 0x7F;
  addr <<= 1;
  Chip_I2CM_WriteByte (i2c->reg, addr | 1);

#if defined(I2C_DMA_MASTER_EN)
  if (i2c->dma_master) {
    if (num > 1024U) { num = 1024U; }

    i2c->info->xfer.pend = num;

    /* Configure master channel */
    dma_context.channel           = i2c->dma_master->ch;
    dma_context.register_location = (volatile uint32_t *)&(i2c->reg->MSTDAT);
    dma_context.width             = DMA_XFERCFG_WIDTH_8;
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_1;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = false;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)i2c->info->xfer.data, num);

    /* Enable DMA transfer and generate start */
    i2c->reg->MSTCTL = I2C_MSTCTL_MSTSTART | I2C_MSTCTL_MSTDMA;
  } else
#endif
  {
    /* Generate start */
    Chip_I2CM_SendStart (i2c->reg);
  }

  /* Enable pending interrupt */
  Chip_I2C_EnableInt (i2c->reg, I2C_INTENSET_MSTPENDING);

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_SlaveTransmit (const uint8_t *data,
                                           uint32_t       num,
                                           I2C_RESOURCES *i2c)
  \brief       Start transmitting data as I2C Slave.
  \param[in]   data  Pointer to buffer with data to transmit to I2C Master
  \param[in]   num   Number of data bytes to transmit
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_SlaveTransmit (const uint8_t *data,
                                   uint32_t       num,
                                   I2C_RESOURCES *i2c) {
#if defined(I2C_DMA_SLAVE_EN)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data == NULL) || (num == 0U)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->info->status.busy) {
    return (ARM_DRIVER_ERROR_BUSY);
  }

  i2c->info->status.bus_error    = 0U;
  i2c->info->status.general_call = 0U;

  i2c->info->xfer.data = (uint8_t *)data;
  i2c->info->xfer.num  = num;
  i2c->info->xfer.cnt  = 0U;
  i2c->info->xfer.ctrl = 0U;

#if defined(I2C_DMA_SLAVE_EN)
  if (i2c->dma_slave) {
    if (num > 1024U) { num = 1024U; }

    i2c->info->xfer.pend = num;

    /* Configure master channel */
    dma_context.channel           = i2c->dma_slave->ch;
    dma_context.register_location = (volatile uint32_t *)&(i2c->reg->SLVDAT);
    dma_context.width             = DMA_XFERCFG_WIDTH_8;
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_1;
    dma_context.write             = true;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)i2c->info->xfer.data, num);
  }
#endif

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_SlaveReceive (uint8_t       *data,
                                          uint32_t       num,
                                          I2C_RESOURCES *i2c)
  \brief       Start receiving data as I2C Slave.
  \param[out]  data  Pointer to buffer for data to receive from I2C Master
  \param[in]   num   Number of data bytes to receive
  \param[in]   i2c   Pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_SlaveReceive (uint8_t       *data,
                                  uint32_t       num,
                                  I2C_RESOURCES *i2c) {
#if defined(I2C_DMA_SLAVE_EN)
  DMA_PERIPHERAL_CONTEXT_T dma_context;
#endif

  if ((data == NULL) || (num == 0U)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if (i2c->info->status.busy) {
    return (ARM_DRIVER_ERROR_BUSY);
  }

  i2c->info->status.bus_error    = 0U;
  i2c->info->status.general_call = 0U;

  i2c->info->xfer.data = data;
  i2c->info->xfer.num  = num;
  i2c->info->xfer.cnt  = 0U;
  i2c->info->xfer.ctrl = 0U;

#if defined(I2C_DMA_SLAVE_EN)
  if (i2c->dma_slave) {
    if (num > 1024U) { num = 1024U; }

    i2c->info->xfer.pend = num;

    /* Configure master channel */
    dma_context.channel           = i2c->dma_slave->ch;
    dma_context.register_location = (volatile uint32_t *)&(i2c->reg->SLVDAT);
    dma_context.width             = DMA_XFERCFG_WIDTH_8;
    dma_context.dst_increment     = DMA_XFERCFG_DSTINC_1;
    dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
    dma_context.write             = false;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)i2c->info->xfer.data, num);
  }
#endif

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t I2Cx_GetDataCount (I2C_RESOURCES *i2c)
  \brief       Get transferred data count.
  \return      number of data bytes transferred; -1 when Slave is not addressed by Master
*/
static int32_t I2Cx_GetDataCount (I2C_RESOURCES *i2c) {
  return ((int32_t)i2c->info->xfer.cnt);
}

/**
  \fn          int32_t I2Cx_Control (uint32_t       control,
                                     uint32_t       arg,
                                     I2C_RESOURCES *i2c)
  \brief       Control I2C Interface.
  \param[in]   control  operation
  \param[in]   arg      argument of operation (optional)
  \param[in]   i2c      pointer to I2C resources
  \return      \ref execution_status
*/
static int32_t I2Cx_Control (uint32_t control, uint32_t arg, I2C_RESOURCES *i2c) {
  uint32_t clk;
  uint32_t i, j;
  uint32_t scl_mode, sda_mode;
  bool state;

