qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
  if ((i2c->info->flags & I2C_POWER) == 0U) {
    /* I2C not powered */
    return ARM_DRIVER_ERROR;
  }

  switch (control) {
    case ARM_I2C_OWN_ADDRESS:
      if (arg & ARM_I2C_ADDRESS_GC) {
        /* Set general call slave address */
        Chip_I2CS_SetSlaveAddr    (i2c->reg, 3, 0);
        Chip_I2CS_EnableSlaveAddr (i2c->reg, 3);
      } else {
        Chip_I2CS_DisableSlaveAddr (i2c->reg, 3);
      }

      if (arg & ARM_I2C_ADDRESS_10BIT) {
        /* Extend slave address to 10-bits */
        Chip_I2CS_SetSlaveQual0 (i2c->reg, true, 0x78U | ((arg & 0x3FFU) >> 8));
        i2c->info->flags |= I2C_SLAVE10BIT;
      } else {
        Chip_I2CS_SetSlaveQual0 (i2c->reg, false, 0);
        i2c->info->flags &= ~I2C_SLAVE10BIT;
      }

      if (arg & 0x7F) {
        /* Set 7-bit slave address */
        Chip_I2CS_SetSlaveAddr    (i2c->reg, 0, arg & 0x7FU);
        Chip_I2CS_EnableSlaveAddr (i2c->reg, 0);
      } else {
        Chip_I2CS_DisableSlaveAddr (i2c->reg, 0);
      }

      if (arg) {
        /* Enable slave mode */
        Chip_I2CS_Enable (i2c->reg);
        /* Enable slave interrupts */
        Chip_I2C_EnableInt (i2c->reg, I2C_INTENSET_SLVPENDING);
      } else {
        /* Disable slave interrupts */
        Chip_I2C_DisableInt (i2c->reg, I2C_INTENSET_SLVPENDING);
        /* Disable slave mode */
        Chip_I2CS_Disable (i2c->reg);
      }
      break;

    case ARM_I2C_BUS_SPEED:
      /* Set Bus Speed */
      switch (arg) {
        case ARM_I2C_BUS_SPEED_STANDARD:
          /* Standard Speed (100kHz) */
          Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, I2C_PIN_IOCON_STANDARD);
          Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, I2C_PIN_IOCON_STANDARD);
          clk = 100000;
          break;

        case ARM_I2C_BUS_SPEED_FAST:
          /* Fast Speed (400kHz) */
          Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, I2C_PIN_IOCON_FAST);
          Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, I2C_PIN_IOCON_FAST);
          clk = 400000;
          break;

        case ARM_I2C_BUS_SPEED_FAST_PLUS:
          /* Fast+ Speed (1MHz) */
          Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, I2C_PIN_IOCON_FAST_PLUS);
          Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, I2C_PIN_IOCON_FAST_PLUS);
          clk = 1000000;
          break;

        default:
          return ARM_DRIVER_ERROR_UNSUPPORTED;
      }
      Chip_I2C_SetClockDiv(i2c->reg, (Chip_Clock_GetFLEXCOMMClockRate(4) / clk) / 4);
      Chip_I2CM_SetBusSpeed (i2c->reg, clk);
      break;

    case ARM_I2C_BUS_CLEAR:
      /* Execute Bus clear */
      SystemCoreClockUpdate();

      /* Frequency is set to approx. standard speed (100kHz) */
      clk = SystemCoreClock / 100000 / 4;

      NVIC_DisableIRQ (i2c->irqn);

      scl_mode = LPC_IOCON->PIO[i2c->scl.port][i2c->scl.pin];
      sda_mode = LPC_IOCON->PIO[i2c->sda.port][i2c->sda.pin];

      /* Configure SCL and SDA as GPIO outputs */
      Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, I2C_PIN_IOCON_GPIO);
      Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, I2C_PIN_IOCON_GPIO);

      Chip_GPIO_SetPinDIROutput(LPC_GPIO, i2c->scl.port, i2c->scl.pin);
      Chip_GPIO_SetPinDIRInput (LPC_GPIO, i2c->sda.port, i2c->sda.pin);

      /* Pull SCL and SDA high */
      Chip_GPIO_SetPinState (LPC_GPIO, i2c->scl.port, i2c->scl.pin, true);
      Chip_GPIO_SetPinState (LPC_GPIO, i2c->sda.port, i2c->sda.pin, true);

      for (i = 0U; i < 9U; i++) {
        if (Chip_GPIO_ReadPortBit(LPC_GPIO, i2c->sda.port, i2c->sda.pin) == true) {
          /* Break if slave released SDA line */
          break;
        }
        /* Clock high */
        Chip_GPIO_SetPinState(LPC_GPIO, i2c->scl.port, i2c->scl.pin, true);
        for (j = 0; j < clk; j++);
        
        /* Clock low */
        Chip_GPIO_SetPinState(LPC_GPIO, i2c->scl.port, i2c->scl.pin, false);
        for (j = 0; j < clk; j++);
      }

      /* Check SDA state */
      state = Chip_GPIO_ReadPortBit(LPC_GPIO, i2c->sda.port, i2c->sda.pin);

      /* Generate STOP condition - SDA goes high while SCL is high */
      Chip_GPIO_SetPinDIROutput (LPC_GPIO, i2c->sda.port, i2c->sda.pin);

      Chip_GPIO_SetPinState (LPC_GPIO, i2c->sda.port, i2c->sda.pin, false);
      for (j = 0; j < clk; j++);
      Chip_GPIO_SetPinState (LPC_GPIO, i2c->scl.port, i2c->scl.pin, true);
      for (j = 0; j < clk; j++);
      Chip_GPIO_SetPinState (LPC_GPIO, i2c->sda.port, i2c->sda.pin, true);

      /* Configure SDA and SCL pins as I2C peripheral pins */
      Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->scl.port, i2c->scl.pin, scl_mode);
      Chip_IOCON_PinMuxSet (LPC_IOCON, i2c->sda.port, i2c->sda.pin, sda_mode);

      /* Send event */
      if (i2c->info->cb_event) {
        i2c->info->cb_event (ARM_I2C_EVENT_BUS_CLEAR);
      }

      NVIC_ClearPendingIRQ (i2c->irqn);
      NVIC_EnableIRQ       (i2c->irqn);

      return (state) ? ARM_DRIVER_OK : ARM_DRIVER_ERROR;

    case ARM_I2C_ABORT_TRANSFER:
      /* Abort Master/Slave transfer */
      NVIC_DisableIRQ (i2c->irqn);

      if (i2c->info->status.mode) {
        /* Master mode */
        Chip_I2CM_SendStop (i2c->reg);

        /* Wait until master idle */
        while (Chip_I2CM_GetMasterState(i2c->reg) != 0);

        Chip_I2CM_Disable (i2c->reg);
      } else {
        /* Slave mode */
        Chip_I2CS_Disable (i2c->reg);
      }

      i2c->info->xfer.data = NULL;
      i2c->info->xfer.cnt  = 0U;

      i2c->info->status.busy             = 0U;
      i2c->info->status.mode             = 0U;
      i2c->info->status.general_call     = 0U;
      i2c->info->status.arbitration_lost = 0U;
      i2c->info->status.bus_error        = 0U;

      /* Enable master */
      Chip_I2CM_Enable (i2c->reg);

      if (i2c->reg->SLVADR[0] & 1) {
        /* Slave address is set, enable slabe */
        Chip_I2CS_Enable (i2c->reg);
      }

      NVIC_ClearPendingIRQ (i2c->irqn);
      NVIC_EnableIRQ       (i2c->irqn);
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_I2C_STATUS I2Cx_GetStatus (I2C_RESOURCES *i2c)
  \brief       Get I2C status.
  \param[in]   i2c      pointer to I2C resources
  \return      I2C status \ref ARM_I2C_STATUS
*/
static ARM_I2C_STATUS I2Cx_GetStatus (I2C_RESOURCES *i2c) {
  return (i2c->info->status);
}


/**
  \fn          void I2Cx_IRQHandler (I2C_RESOURCES *i2c)
  \brief       I2C Event Interrupt handler.
  \param[in]   i2c  Pointer to I2C resources
*/
static void I2Cx_IRQHandler (I2C_RESOURCES *i2c) {
  I2C_TRANSFER_INFO *tr = &i2c->info->xfer;
  uint32_t status, event;
  uint8_t  data;

  event  = 0U;
  status = Chip_I2C_GetPendingInt (i2c->reg);

  if (status & I2C_MASTER_INTERRUPTS) {
    /* Master interrupt is pending */
    if (status & I2C_INTENSET_MSTPENDING) {
      /* Master is Pending */
      switch (Chip_I2CM_GetMasterState(i2c->reg)) {
        case I2C_STAT_MSTCODE_IDLE:   /* Master idle */
          /* Transfer done */
          event = ARM_I2C_EVENT_TRANSFER_DONE;

          i2c->info->status.busy = 0U;

          /* Disable pending interrupt */
          Chip_I2C_DisableInt (i2c->reg, I2C_INTENSET_MSTPENDING);
          break;

          case I2C_STAT_MSTCODE_RXREADY: /* Rx ready. Received data available */
            if (tr->cnt < tr->num) {
              /* Interrupt data transfer */
              tr->data[tr->cnt] = Chip_I2CM_ReadByte(i2c->reg);
              tr->cnt++;
            }

