qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
            if (tr->cnt < tr->num) {
              Chip_I2CM_MasterContinue (i2c->reg);
            }
            else {
              /* Transfer done */
              if ((tr->ctrl & XFER_CTRL_XPENDING) == 0) {
                /* Generate stop */
                Chip_I2CM_SendStop (i2c->reg);
              }
              else {
                /* Transfer done */
                event = ARM_I2C_EVENT_TRANSFER_DONE;

                i2c->info->status.busy = 0U;

                /* Disable pending interrupt */
                Chip_I2C_DisableInt (i2c->reg, I2C_INTENSET_MSTPENDING);
              }
            }
            break;

          case I2C_STAT_MSTCODE_TXREADY: /* Tx ready. Data can be transmitted */
            if (tr->ctrl & XFER_CTRL_ADDR_DONE) {
              /* Addressing done, transfer data */
              if (tr->cnt < tr->num) {
                /* Interrupt data transfer */
                Chip_I2CM_WriteByte (i2c->reg, tr->data[tr->cnt]);
                tr->cnt++;

                Chip_I2CM_MasterContinue (i2c->reg);
              }
              else {
                /* Transfer done */
                event = ARM_I2C_EVENT_TRANSFER_DONE;

                i2c->info->status.busy = 0U;

                /* Disable pending interrupt */
                Chip_I2C_DisableInt (i2c->reg, I2C_INTENSET_MSTPENDING);

                if ((tr->ctrl & XFER_CTRL_XPENDING) == 0) {
                  /* Generate stop */
                  Chip_I2CM_SendStop (i2c->reg);
                }
              }
            }
            else {
              /* Send 2nd byte of 10-bit address */
              Chip_I2CM_WriteByte      (i2c->reg, (uint8_t)tr->addr);
              Chip_I2CM_MasterContinue (i2c->reg);

              /* Addressing is now done */
              tr->ctrl |= XFER_CTRL_ADDR_DONE;
            }
            break;

          case I2C_STAT_MSTCODE_NACKADR: /* NACK Address. Slave NACKed address */
            event = ARM_I2C_EVENT_TRANSFER_DONE | ARM_I2C_EVENT_ADDRESS_NACK;

            /* Generate stop */
            Chip_I2CM_SendStop (i2c->reg);
            break;

          case I2C_STAT_MSTCODE_NACKDAT: /* NACK Data. Slave NACKed transmitted data */
            event = ARM_I2C_EVENT_TRANSFER_DONE | ARM_I2C_EVENT_TRANSFER_INCOMPLETE;

            /* Generate stop */
            Chip_I2CM_SendStop (i2c->reg);
            break;

          default: /* Illegal master state, should never happen */
            Chip_I2CM_MasterContinue (i2c->reg);
            break;
      }
    }
    else {
      if (status & I2C_INTENSET_MSTRARBLOSS) {
        /* Arbitration lost */
        Chip_I2CM_ClearStatus(i2c->reg, I2C_STAT_MSTRARBLOSS);

        /* Update status */
        i2c->info->status.arbitration_lost = 1U;
        i2c->info->status.busy             = 0U;

        /* Reset transfer state */
        tr->data = NULL;

        /* Set arbitration lost event */
        event |= ARM_I2C_EVENT_TRANSFER_DONE | ARM_I2C_EVENT_ARBITRATION_LOST;

        if (tr->cnt < tr->num) {
          event |= ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
        }
      }
      else /*status & I2C_INTENSET_MSTSTSTPERR */ {
        /* Start/Stop error */
        Chip_I2CM_ClearStatus(i2c->reg, I2C_STAT_MSTSTSTPERR);

        /* Update status */
        i2c->info->status.bus_error = 1U;
        i2c->info->status.busy      = 0U;

        /* Reset transfer state */
        tr->data = NULL;

        /* Set bus error event */
        event |= ARM_I2C_EVENT_TRANSFER_DONE | ARM_I2C_EVENT_BUS_ERROR;

        if (tr->cnt < tr->num) {
          event |= ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
        }
      }
    }
  }
  else if (status & I2C_SLAVE_INTERRUPTS) {
    /* Slave interrupt is pending */
    if (status & I2C_INTENSET_SLVPENDING) {

      switch (Chip_I2CS_GetSlaveState (i2c->reg)) {
        case I2C_STAT_SLVCODE_ADDR: /* Address plus R/nW received */
          Chip_I2C_EnableInt (i2c->reg, I2C_INTENSET_SLVDESEL);

          /* Read received address, LSB is R/nW */
          data = Chip_I2CS_ReadByte(i2c->reg);

          if (data & 1) { event = ARM_I2C_EVENT_SLAVE_TRANSMIT; }
          else          { event = ARM_I2C_EVENT_SLAVE_RECEIVE;  }

          if (i2c->info->cb_event) {
            if (Chip_I2CS_GetSlaveMatchIndex(i2c->reg) == 3) {
              /* General call address match */
              i2c->info->cb_event (event | ARM_I2C_EVENT_GENERAL_CALL);
            } else {
              if (tr->data == NULL) {
                /* Transfer data is not set */
                i2c->info->cb_event (event);
              }
            }
          }
          event = 0U;

          if ((i2c->info->flags & I2C_SLAVE10BIT) == 0U) {
            /* 7-bit addressing */
            tr->ctrl |= XFER_CTRL_ADDR_DONE;
          }

          i2c->info->status.busy = 1U;

          /* Ack the address */
          Chip_I2CS_SlaveContinue (i2c->reg);
          break;

        case I2C_STAT_SLVCODE_RX:   /* Received data is available */
          if ((tr->ctrl & XFER_CTRL_ADDR_DONE) == 0U) {
            /* 10-bit addressing: 2nd address byte received */
            tr->ctrl |= XFER_CTRL_ADDR_DONE;

            Chip_I2CS_ReadByte(i2c->reg);
            Chip_I2CS_SlaveContinue (i2c->reg);
          }
          else {
            /* Data transfer */
            if (tr->data == NULL) {
              /* Data buffer not set */
              Chip_I2CS_SlaveNACK (i2c->reg);
            }
            else {
              /* IRQ data transfer */
              if (tr->cnt < tr->num) {
                tr->data[tr->cnt] = Chip_I2CS_ReadByte(i2c->reg);
                tr->cnt++;
              }
              Chip_I2CS_SlaveContinue (i2c->reg);
            }
          }
          break;

        case I2C_STAT_SLVCODE_TX:   /* Data can be transmitted */
          if (tr->data == NULL) {
            /* Data buffer not set */
            Chip_I2CM_WriteByte (i2c->reg, 0xFFU);
          }
          else {
            /* IRQ data transfer */
            if (tr->cnt < tr->num) {
              Chip_I2CM_WriteByte (i2c->reg, tr->data[tr->cnt]);
              tr->cnt++;
            }
          }
          Chip_I2CS_SlaveContinue (i2c->reg);
          break;
      }
    }
    else {
      if (status & I2C_INTENSET_SLVDESEL) {
        /* Slave deselected */
        Chip_I2C_DisableInt (i2c->reg, I2C_INTENSET_SLVDESEL);

        if (tr->data) {
          tr->data = NULL;

          event = ARM_I2C_EVENT_TRANSFER_DONE;

