qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
          if (tr->cnt < tr->num) {
            event |= ARM_I2C_EVENT_TRANSFER_INCOMPLETE;
          }

          if (i2c->info->status.general_call) {
            event |= ARM_I2C_EVENT_GENERAL_CALL;
          }
        }
        i2c->info->status.busy = 0U;
      }
    }
  }

  /* Callback event notification */
  if (event && i2c->info->cb_event) {
    i2c->info->cb_event (event);
  }
}


#if defined(I2C_DMA_MASTER_EN) || defined(I2C_DMA_SLAVE_EN)
/**
  \fn          void I2C_DMAHandler (const I2C_RESOURCES *i2c)
  \brief       I2C DMA interrupt handler
  \param[in]   i2c  Pointer to I2C resources
*/
void I2C_DMAHandler (const I2C_RESOURCES *i2c) {
  I2C_TRANSFER_INFO *tr = &i2c->info->xfer;
  DMA_PERIPHERAL_CONTEXT_T  dma_context;
  uint32_t num;

  tr->data += tr->pend;
  tr->cnt  += tr->pend;

  if (tr->num < tr->num) {
    /* Reload DMA */
    num = tr->num - tr->cnt;

    if (num > 1024U) { num = 1024U; }

    tr->pend = num;

    if (i2c->info->status.mode) {
      /* Master */
      dma_context.channel           = i2c->dma_master->ch;
      dma_context.register_location = (volatile uint32_t *)&(i2c->reg->MSTDAT);
    }
    else {
      /* Slave */
      dma_context.channel           = i2c->dma_slave->ch;
      dma_context.register_location = (volatile uint32_t *)&(i2c->reg->SLVDAT);
    }

    if (i2c->info->status.direction) {
      /* Receive */
      dma_context.dst_increment     = DMA_XFERCFG_DSTINC_1;
      dma_context.src_increment     = DMA_XFERCFG_SRCINC_0;
      dma_context.write             = false;
    }
    else {
      /* Transmit */
      dma_context.dst_increment     = DMA_XFERCFG_DSTINC_0;
      dma_context.src_increment     = DMA_XFERCFG_SRCINC_1;
      dma_context.write             = true;
    }

    dma_context.width = DMA_XFERCFG_WIDTH_8;

    Chip_DMASERVICE_SingleBuffer (&dma_context, (uint32_t)tr->data, num);

    if (i2c->info->status.mode) {
      i2c->reg->MSTCTL = I2C_MSTCTL_MSTDMA | I2C_MSTCTL_MSTCONTINUE;
    } else {
      i2c->reg->SLVCTL = I2C_SLVCTL_SLVDMA | I2C_SLVCTL_SLVCONTINUE;
    }
  }
  else {
    /* Transfer completed */
    if (i2c->info->status.mode) { Chip_I2CM_MasterContinue(i2c->reg); }
    else                        { Chip_I2CS_SlaveContinue (i2c->reg); }
  }
}
#endif


#ifdef RTE_I2C0
/* I2C0 Driver wrapper functions */
static int32_t I2C0_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C0_Resources));
}
static int32_t I2C0_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C0_Resources));
}
static int32_t I2C0_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C0_Resources));
}
static int32_t I2C0_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C0_Resources));
}
static int32_t I2C0_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C0_Resources));
}
static int32_t I2C0_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C0_Resources));
}
static int32_t I2C0_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C0_Resources));
}
static int32_t I2C0_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C0_Resources));
}
static int32_t I2C0_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C0_Resources));
}
static ARM_I2C_STATUS I2C0_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C0_Resources));
}
/* I2C0 interrupt handler */
void I2C0_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C0_Resources);
}

#if defined(I2C0_DMA_MASTER_EN) || defined(I2C0_DMA_SLAVE_EN)
void I2C0_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C0_Resources);
}
#endif


/* I2C0 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C0 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C0_Initialize,
  I2C0_Uninitialize,
  I2C0_PowerControl,
  I2C0_MasterTransmit,
  I2C0_MasterReceive,
  I2C0_SlaveTransmit,
  I2C0_SlaveReceive,
  I2C0_GetDataCount,
  I2C0_Control,
  I2C0_GetStatus
};
#endif

#ifdef RTE_I2C1
/* I2C1 Driver wrapper functions */
static int32_t I2C1_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C1_Resources));
}
static int32_t I2C1_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C1_Resources));
}
static int32_t I2C1_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C1_Resources));
}
static int32_t I2C1_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C1_Resources));
}
static int32_t I2C1_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C1_Resources));
}
static int32_t I2C1_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C1_Resources));
}
static int32_t I2C1_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C1_Resources));
}
static int32_t I2C1_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C1_Resources));
}
static int32_t I2C1_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C1_Resources));
}
static ARM_I2C_STATUS I2C1_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C1_Resources));
}
/* I2C1 interrupt handler */
void I2C1_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C1_Resources);
}

#if defined(I2C1_DMA_MASTER_EN) || defined(I2C1_DMA_SLAVE_EN)
void I2C1_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C1_Resources);
}
#endif


/* I2C1 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C1 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C1_Initialize,
  I2C1_Uninitialize,
  I2C1_PowerControl,
  I2C1_MasterTransmit,
  I2C1_MasterReceive,
  I2C1_SlaveTransmit,
  I2C1_SlaveReceive,
  I2C1_GetDataCount,
  I2C1_Control,
  I2C1_GetStatus
};
#endif

#ifdef RTE_I2C2
/* I2C2 Driver wrapper functions */
static int32_t I2C2_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C2_Resources));
}
static int32_t I2C2_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C2_Resources));
}
static int32_t I2C2_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C2_Resources));
}
static int32_t I2C2_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C2_Resources));
}
static int32_t I2C2_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C2_Resources));
}
static int32_t I2C2_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C2_Resources));
}
static int32_t I2C2_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C2_Resources));
}
static int32_t I2C2_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C2_Resources));
}
static int32_t I2C2_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C2_Resources));
}
static ARM_I2C_STATUS I2C2_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C2_Resources));
}
/* I2C2 interrupt handler */
void I2C2_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C2_Resources);
}

#if defined(I2C2_DMA_MASTER_EN) || defined(I2C2_DMA_SLAVE_EN)
void I2C2_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C2_Resources);
}
#endif


/* I2C2 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C2 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C2_Initialize,
  I2C2_Uninitialize,
  I2C2_PowerControl,
  I2C2_MasterTransmit,
  I2C2_MasterReceive,
  I2C2_SlaveTransmit,
  I2C2_SlaveReceive,
  I2C2_GetDataCount,
  I2C2_Control,
  I2C2_GetStatus
};
#endif

