qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
#ifdef RTE_I2C3
/* I2C3 Driver wrapper functions */
static int32_t I2C3_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C3_Resources));
}
static int32_t I2C3_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C3_Resources));
}
static int32_t I2C3_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C3_Resources));
}
static int32_t I2C3_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C3_Resources));
}
static int32_t I2C3_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C3_Resources));
}
static int32_t I2C3_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C3_Resources));
}
static int32_t I2C3_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C3_Resources));
}
static int32_t I2C3_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C3_Resources));
}
static int32_t I2C3_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C3_Resources));
}
static ARM_I2C_STATUS I2C3_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C3_Resources));
}
/* I2C3 interrupt handler */
void I2C3_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C3_Resources);
}

#if defined(I2C3_DMA_MASTER_EN) || defined(I2C3_DMA_SLAVE_EN)
void I2C3_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C3_Resources);
}
#endif

/* I2C3 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C3 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C3_Initialize,
  I2C3_Uninitialize,
  I2C3_PowerControl,
  I2C3_MasterTransmit,
  I2C3_MasterReceive,
  I2C3_SlaveTransmit,
  I2C3_SlaveReceive,
  I2C3_GetDataCount,
  I2C3_Control,
  I2C3_GetStatus
};
#endif

#ifdef RTE_I2C4
/* I2C4 Driver wrapper functions */
static int32_t I2C4_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C4_Resources));
}
static int32_t I2C4_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C4_Resources));
}
static int32_t I2C4_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C4_Resources));
}
static int32_t I2C4_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C4_Resources));
}
static int32_t I2C4_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C4_Resources));
}
static int32_t I2C4_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C4_Resources));
}
static int32_t I2C4_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C4_Resources));
}
static int32_t I2C4_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C4_Resources));
}
static int32_t I2C4_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C4_Resources));
}
static ARM_I2C_STATUS I2C4_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C4_Resources));
}
/* I2C4 interrupt handler */
void I2C4_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C4_Resources);
}

#if defined(I2C4_DMA_MASTER_EN) || defined(I2C4_DMA_SLAVE_EN)
void I2C4_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C4_Resources);
}
#endif

/* I2C4 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C4 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C4_Initialize,
  I2C4_Uninitialize,
  I2C4_PowerControl,
  I2C4_MasterTransmit,
  I2C4_MasterReceive,
  I2C4_SlaveTransmit,
  I2C4_SlaveReceive,
  I2C4_GetDataCount,
  I2C4_Control,
  I2C4_GetStatus
};
#endif

#ifdef RTE_I2C5
/* I2C5 Driver wrapper functions */
static int32_t I2C5_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C5_Resources));
}
static int32_t I2C5_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C5_Resources));
}
static int32_t I2C5_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C5_Resources));
}
static int32_t I2C5_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C5_Resources));
}
static int32_t I2C5_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C5_Resources));
}
static int32_t I2C5_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C5_Resources));
}
static int32_t I2C5_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C5_Resources));
}
static int32_t I2C5_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C5_Resources));
}
static int32_t I2C5_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C5_Resources));
}
static ARM_I2C_STATUS I2C5_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C5_Resources));
}
/* I2C5 interrupt handler */
void I2C5_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C5_Resources);
}

#if defined(I2C5_DMA_MASTER_EN) || defined(I2C5_DMA_SLAVE_EN)
void I2C5_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C5_Resources);
}
#endif

/* I2C5 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C5 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C5_Initialize,
  I2C5_Uninitialize,
  I2C5_PowerControl,
  I2C5_MasterTransmit,
  I2C5_MasterReceive,
  I2C5_SlaveTransmit,
  I2C5_SlaveReceive,
  I2C5_GetDataCount,
  I2C5_Control,
  I2C5_GetStatus
};
#endif

#ifdef RTE_I2C6
/* I2C6 Driver wrapper functions */
static int32_t I2C6_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C6_Resources));
}
static int32_t I2C6_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C6_Resources));
}
static int32_t I2C6_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C6_Resources));
}
static int32_t I2C6_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C6_Resources));
}
static int32_t I2C6_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C6_Resources));
}
static int32_t I2C6_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C6_Resources));
}
static int32_t I2C6_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C6_Resources));
}
static int32_t I2C6_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C6_Resources));
}
static int32_t I2C6_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C6_Resources));
}
static ARM_I2C_STATUS I2C6_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C6_Resources));
}
/* I2C6 interrupt handler */
void I2C6_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C6_Resources);
}

