qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/I2C_LPC5411x.c
#if defined(I2C6_DMA_MASTER_EN) || defined(I2C6_DMA_SLAVE_EN)
void I2C6_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C6_Resources);
}
#endif

/* I2C6 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C6 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C6_Initialize,
  I2C6_Uninitialize,
  I2C6_PowerControl,
  I2C6_MasterTransmit,
  I2C6_MasterReceive,
  I2C6_SlaveTransmit,
  I2C6_SlaveReceive,
  I2C6_GetDataCount,
  I2C6_Control,
  I2C6_GetStatus
};
#endif

#ifdef RTE_I2C7
/* I2C7 Driver wrapper functions */
static int32_t I2C7_Initialize (ARM_I2C_SignalEvent_t cb_event) {
  return (I2Cx_Initialize (cb_event, &I2C7_Resources));
}
static int32_t I2C7_Uninitialize (void) {
  return (I2Cx_Uninitialize (&I2C7_Resources));
}
static int32_t I2C7_PowerControl (ARM_POWER_STATE state) {
  return (I2Cx_PowerControl (state, &I2C7_Resources));
}
static int32_t I2C7_MasterTransmit (uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterTransmit (addr, data, num, xfer_pending, &I2C7_Resources));
}
static int32_t I2C7_MasterReceive (uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending) {
  return (I2Cx_MasterReceive (addr, data, num, xfer_pending, &I2C7_Resources));
}
static int32_t I2C7_SlaveTransmit (const uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveTransmit (data, num, &I2C7_Resources));
}
static int32_t I2C7_SlaveReceive (uint8_t *data, uint32_t num) {
  return (I2Cx_SlaveReceive (data, num, &I2C7_Resources));
}
static int32_t I2C7_GetDataCount (void) {
  return (I2Cx_GetDataCount (&I2C7_Resources));
}
static int32_t I2C7_Control (uint32_t control, uint32_t arg) {
  return (I2Cx_Control (control, arg, &I2C7_Resources));
}
static ARM_I2C_STATUS I2C7_GetStatus (void) {
  return (I2Cx_GetStatus (&I2C7_Resources));
}
/* I2C7 interrupt handler */
void I2C7_IRQHandler (void) {
  I2Cx_IRQHandler (&I2C7_Resources);
}

#if defined(I2C7_DMA_MASTER_EN) || defined(I2C7_DMA_SLAVE_EN)
void I2C7_DMA_Callback (int32_t val) {
  I2C_DMAHandler (&I2C7_Resources);
}
#endif

/* I2C7 Driver Control Block */
ARM_DRIVER_I2C Driver_I2C7 = {
  I2C_GetVersion,
  I2C_GetCapabilities,
  I2C7_Initialize,
  I2C7_Uninitialize,
  I2C7_PowerControl,
  I2C7_MasterTransmit,
  I2C7_MasterReceive,
  I2C7_SlaveTransmit,
  I2C7_SlaveReceive,
  I2C7_GetDataCount,
  I2C7_Control,
  I2C7_GetStatus
};
#endif
